beber007/zottaos/ZottaOS/CORTEX-Mx/STM32/ZottaOS_Interrupts.c
/* Copyright (c) 2006-2012 MIS Institute of the HEIG-VD affiliated to the University of
** Applied Sciences of Western Switzerland. All rights reserved.
** Permission to use, copy, modify, and distribute this software and its documentation
** for any purpose, without fee, and without written agreement is hereby granted, pro-
** vided that the above copyright notice, the following three sentences and the authors
** appear in all copies of this software and in the software where it is used.
** IN NO EVENT SHALL THE MIS INSTITUTE NOR THE HEIG-VD NOR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL,
** INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS
** DOCUMENTATION, EVEN IF THE MIS INSTITUTE OR THE HEIG-VD OR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
** THE MIS INSTITUTE, THE HEIG-VD AND THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWIT-
** ZERLAND SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
** IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFT-
** WARE PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE MIS INSTITUTE NOR THE HEIG-VD
** AND NOR THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWITZERLAND HAVE NO OBLIGATION
** TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
*/
/* File ZottaOS_Interrupts.c: Defines the internal vector interruption table that binds
**   peripheral device handlers to a particular entry and that can be manipulated via
**   functions OSSetTimerISRDescriptor and OSGetTimerISRDescriptor.
** Platform version: All STM32 microcontrollers.
** Version date: March 2012
** Authors: MIS-TIC
*/

#include "ZottaOS.h"
#include "ZottaOS_Timer.h"

/* Table of devices used by the interrupt handler and the peripheral devices to obtain
** the appropriate I/O routine.
** These peripherals are
**   in fact the IRQs defined for Cortex-Mx and are appended to the 15 system exceptions
**   defined in ZottaOS_CortexMx.c. */ claude pas fini

/* Chaque entrées est initialisées NULL ou pointe sur un structure de type TIMERSELECT dans le
** cas ou l'entrée correspond à un vecteur ayant comme source plusieurs timer. TIMERSELECT
** est définit dans ZottaOS_Timer.h */

#if defined(STM32F050XX)
   void *_OSTabDevice[28] = {
      NULL, /* OS_IO_WWDG
         0  Window watchdog */
      NULL, /* OS_IO_PVD              1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_RTC              2  RTC through EXTI line */
      NULL, /* OS_IO_FLASH            3  Flash */
      NULL, /* OS_IO_RCC              4  RCC */
      NULL, /* OS_IO_EXTI0_1          5  EXTI lines 0 and 1 */
      NULL, /* OS_IO_EXTI2_3          6  EXTI lines 2 and 3 */
      NULL, /* OS_IO_EXTI4_15         7  EXTI lines 4 to 15 */
      NULL, /* OS_IO_TS               8  TS */
      NULL, /* OS_IO_DMA1_Channel1    9  DMA1 channel 1 */
      NULL, /* OS_IO_DMA1_Channel2_3 10  DMA1 channels 2 and 3 */
      NULL, /* OS_IO_DMA1_Channel4_5 11  DMA1 channels 4 and 5 */
      NULL, /* ADC1_COMP             12  ADC1, COMP1 and COMP2 */
      NULL, /* TIM1_BRK_UP_TRG_COM   13  TIM1 Break, Update, Trigger and Commutation */
      NULL, /* TIM1_CC               14  TIM1 Capture Compare */
      NULL, /* TIM2                  15  TIM2 */
      NULL, /* TIM3                  16  TIM3 */
      NULL,
      NULL,
      NULL, /* OS_IO_TIM14          19  TIM14 */
      NULL,
      NULL, /* OS_IO_TIM16          21  TIM16 */
      NULL, /* OS_IO_TIM17          22  TIM17 */
      NULL, /* OS_IO_I2C1           23  I2C1 */
      NULL,
      NULL, /* OS_IO_SPI1           25  SPI1 */
      NULL,
      NULL  /* OS_IO_USART1         27  USART1 */
   };
#elif defined(STM32F051X4) || defined(STM32F051K6_K8_C6_R6) || defined(STM32F051C8_R8)
   void *_OSTabDevice[31] = {
      NULL, /* OS_IO_WWDG             0  Window watchDog */
      NULL, /* OS_IO_PVD              1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_RTC              2  RTC through EXTI line */
      NULL, /* OS_IO_FLASH            3  Flash */
      NULL, /* OS_IO_RCC              4  RCC */
      NULL, /* OS_IO_EXTI0_1          5  EXTI lines 0 and 1 */
      NULL, /* OS_IO_EXTI2_3          6  EXTI lines 2 and 3 */
      NULL, /* OS_IO_EXTI4_15         7  EXTI lines 4 to 15 */
      NULL, /* OS_IO_TS               8  TS */
      NULL, /* OS_IO_DMA1_Channel1    9  DMA1 channel 1 */
      NULL, /* OS_IO_DMA1_Channel2_3 10  DMA1 channels 2 and 3 */
      NULL, /* OS_IO_DMA1_Channel4_5 11  DMA1 channels 4 and 5 */
      NULL, /* ADC1_COMP             12  ADC1, COMP1 and COMP2 */
      NULL, /* TIM1_BRK_UP_TRG_COM   13  TIM1 Break, Update, Trigger and Commutation */
      NULL, /* TIM1_CC               14  TIM1 Capture Compare */
      NULL, /* TIM2                  15  TIM2 */
      NULL, /* TIM3                  16  TIM3 */
      NULL, /* TIM6_DAC              17  TIM6 and DAC */
      NULL,
      NULL, /* OS_IO_TIM14           19  TIM14 */
      NULL, /* OS_IO_TIM15           20  TIM15 */
      NULL, /* OS_IO_TIM16           21  TIM16 */
      NULL, /* OS_IO_TIM17           22  TIM17 */
      NULL, /* OS_IO_I2C1            23  I2C1 */
      #if defined(STM32F051C8_R8)
         NULL, /* OS_IO_I2C2       24  I2C2 */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_SPI1          25  SPI1 */
      #if defined(STM32F051C8_R8)
         NULL, /* OS_IO_SPI2       26  SPI2 */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_USART1        27  USART1 */
      #if defined(STM32F051K6_K8_C6_R6) || defined(STM32F051C8_R8)
         NULL, /* OS_IO_USART2     28  USART2 */
      #else
         NULL,
      #endif
      NULL,
      NULL  /* OS_IO_CEC           30  CEC */
   };
#elif defined(STM32L151X6_X8_XB) || defined(STM32L152X6_X8_XB)
   void *_OSTabDevice[45] = {
      NULL, /* OS_IO_WWDG           0  Window watchDog */
      NULL, /* OS_IO_PVD            1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMP_STAMP     2  Tamper and TimeStamp through the EXTI line*/
      NULL, /* OS_IO_RTC_WKUP       3  RTC wakeup through the EXTI line */
      NULL, /* OS_IO_FLASH          4  Flash global */
      NULL, /* OS_IO_RCC            5  RCC globa l */
      NULL, /* OS_IO_EXTI0          6  EXTI line 0 */
      NULL, /* OS_IO_EXTI1          7  EXTI line 1 */
      NULL, /* OS_IO_EXTI2          8  EXTI line 2 */
      NULL, /* OS_IO_EXTI3          9  EXTI line 3 */
      NULL, /* OS_IO_EXTI4         10  EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1 11  DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12  DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13  DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14  DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15  DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16  DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17  DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1          18  ADC1 global */
      NULL, /* OS_IO_USB_HP        19  USB High Priority */
      NULL, /* OS_IO_USB_LP        20  USB Low Priority */
      NULL, /* OS_IO_DAC           21  DAC */
      NULL, /* OS_IO_COMP          22  Comparator through EXTI line */
      NULL, /* OS_IO_EXTI9_5       23  External line [9:5] */
      #if defined(STM32L152X6_X8_XB)
         NULL, /* OS_IO_LCD        24  LCD */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_TIM9          25  TIM9 global */
      NULL, /* OS_IO_TIM10         26  TIM10 global */
      NULL, /* OS_IO_TIM11         27  TIM11 global */
      NULL, /* OS_IO_TIM2          28  TIM2 global */
      NULL, /* OS_IO_TIM3          29  TIM3 global */
      NULL, /* OS_IO_TIM4          30  TIM4 global */
      NULL, /* OS_IO_I2C1_EV       31  I2C1 event */
      NULL, /* OS_IO_I2C1_ER       32  I2C1 error */
      NULL, /* OS_IO_I2C2_EV       33  I2C2 event */
      NULL, /* OS_IO_I2C2_ER       34  I2C2 error */
      NULL, /* OS_IO_SPI1          35  SPI1 global */
      NULL, /* OS_IO_SPI2          36  SPI2 global */
      NULL, /* OS_IO_USART1        37  USART1 global */
      NULL, /* OS_IO_USART2        38  USART2 global */
      NULL, /* OS_IO_USART3        39  USART3 global */
      NULL, /* OS_IO_EXTI15_10     40  External line [15:10]  */
      NULL, /* OS_IO_RTC_Alarm     41  RTC alarm through EXTI line */
      NULL, /* OS_IO_USB_FS_WKUP   42  USB FS wakeUp from suspend through EXTI line */
      NULL, /* OS_IO_TIM6          43  TIM6 global */
      NULL  /* OS_IO_TIM7          44  TIM7 global */
   };
#elif defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
   void *_OSTabDevice[57] = {
      NULL, /* OS_IO_WWDG           0  Window watchDog */
      NULL, /* OS_IO_PVD            1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMP_STAMP     2  Tamper and TimeStamp through the EXTI line*/
      NULL, /* OS_IO_RTC_WKUP       3  RTC wakeup through the EXTI line */
      NULL, /* OS_IO_FLASH          4  Flash global */
      NULL, /* OS_IO_RCC            5  RCC global */
      NULL, /* OS_IO_EXTI0          6  EXTI line 0 */
      NULL, /* OS_IO_EXTI1          7  EXTI line 1 */
      NULL, /* OS_IO_EXTI2          8  EXTI line 2 */
      NULL, /* OS_IO_EXTI3          9  EXTI line 3 */
      NULL, /* OS_IO_EXTI4         10  EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1 11  DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12  DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13  DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14  DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15  DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16  DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17  DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1          18  ADC1 global */
      NULL, /* OS_IO_USB_HP        19  USB high priority */
      NULL, /* OS_IO_USB_LP        20  USB low priority */
      NULL, /* OS_IO_DAC           21  DAC */
      NULL, /* OS_IO_COMP_CA       22  Comparator and channel acquisition through EXTI line */
      NULL, /* OS_IO_EXTI9_5       23  External line [9:5] */
      #if defined(STM32L152XC) || defined(STM32L152XD) || defined(STM32L162XD)
         NULL, /* OS_IO_LCD        24  LCD */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_TIM9          25  TIM9 global */
      NULL, /* OS_IO_TIM10         26  TIM10 global */
      NULL, /* OS_IO_TIM11         27  TIM11 global */
      NULL, /* OS_IO_TIM2          28  TIM2 global */
      NULL, /* OS_IO_TIM3          29  TIM3 global */
      NULL, /* OS_IO_TIM4          30  TIM4 global */
      NULL, /* OS_IO_I2C1_EV       31  I2C1 event */
      NULL, /* OS_IO_I2C1_ER       32  I2C1 error */
      NULL, /* OS_IO_I2C2_EV       33  I2C2 event */
      NULL, /* OS_IO_I2C2_ER       34  I2C2 error */
      NULL, /* OS_IO_SPI1          35  SPI1 global */
      NULL, /* OS_IO_SPI2          36  SPI2 global */
      NULL, /* OS_IO_USART1        37  USART1 global */
      NULL, /* OS_IO_USART2        38  USART2 global */
      NULL, /* OS_IO_USART3        39  USART3 global */
      NULL, /* OS_IO_EXTI15_10     40  External line [15:10]  */
      NULL, /* OS_IO_RTC_Alarm     41  RTC alarm through EXTI line */
      NULL, /* OS_IO_USB_FS_WKUP   42  USB FS WakeUp from suspend through EXTI line */
      NULL, /* OS_IO_TIM6          43  TIM6 global */
      NULL, /* OS_IO_TIM7          44  TIM7 global */
      #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
         NULL, /* OS_IO_SDIO       45  SDIO global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_TIM5          46  TIM5 global */
      NULL, /* OS_IO_SPI3          47  SPI3 global */
      #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
         NULL, /* OS_IO_UART4      48  UART4 global */
         NULL, /* OS_IO_UART5      49  UART5 global */
      #else
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_DMA2_Channel1 50  DMA2 channel 1 global */
      NULL, /* OS_IO_DMA2_Channel2 51  DMA2 channel 2 global */
      NULL, /* OS_IO_DMA2_Channel3 52  DMA2 channel 3 global */
      NULL, /* OS_IO_DMA2_Channel4 53  DMA2 channel 4 global */
      NULL, /* OS_IO_DMA2_Channel5 54  DMA2 channel 5 global */
      #if defined(STM32L162XD)
         NULL, /* OS_IO_AES        55  AES global */
      #else
         NULL,
      #endif
      NULL , /* OS_IO_COMP_ACQ 56  Comparator Channel Acquisition global */
   };
#elif defined(STM32F101T8_TB) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101X4_X6)
   void *_OSTabDevice[42] = {
      NULL, /* OS_IO_WWDG           0 Window watchDog */
      NULL, /* OS_IO_PVD            1 Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMPER         2 Tamper */
      NULL, /* OS_IO_RTC            3 RTC global */
      NULL, /* OS_IO_FLASH          4 Flash global */
      NULL, /* OS_IO_RCC            5 RCC global */
      NULL, /* OS_IO_EXTI0          6 EXTI line 0 */
      NULL, /* OS_IO_EXTI1          7 EXTI line 1 */
      NULL, /* OS_IO_EXTI2          8 EXTI line 2 */
      NULL, /* OS_IO_EXTI3          9 EXTI line 3 */
      NULL, /* OS_IO_EXTI4         10 EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1 11 DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12 DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13 DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14 DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15 DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16 DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17 DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1          18 ADC1 global */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_EXTI9_5       23 External line [9:5] */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_TIM2          28  TIM2 global */
      NULL, /* OS_IO_TIM3          29  TIM3 global */
      #if defined(STM32F101T8_TB) || defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_TIM4       30 TIM4 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_I2C1_EV       31 I2C1 event */
      NULL, /* OS_IO_I2C1_ER       32 I2C1 error */
      #if defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_I2C2_EV    33 I2C2 event */
         NULL, /* OS_IO_I2C2_ER    34 I2C2 error */
      #else
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_SPI1          35 SPI1 global */
      #if defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_SPI2       36 SPI2 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_USART1        37 USART1 global */
      NULL, /* OS_IO_USART2        38 USART2 global */
      #if defined(STM32F101C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_USART3     39 USART3 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_EXTI15_10     40 External line [15:10] */
      NULL  /* OS_IO_RTCAlarm      41 RTC alarm through EXTI line */
   };
#elif defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F102X4_X6) || \
      defined(STM32F102X8_XB)
   void *_OSTabDevice[43] = {
      NULL, /* OS_IO_WWDG             0 Window watchDog */
      NULL, /* OS_IO_PVD              1 Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMPER           2 Tamper */
      NULL, /* OS_IO_RTC              3 RTC global */
      NULL, /* OS_IO_FLASH            4 Flash global */
      NULL, /* OS_IO_RCC              5 RCC global */
      NULL, /* OS_IO_EXTI0            6 EXTI line 0 */
      NULL, /* OS_IO_EXTI1            7 EXTI line 1 */
      NULL, /* OS_IO_EXTI2            8 EXTI line 2 */
      NULL, /* OS_IO_EXTI3            9 EXTI line 3 */
      NULL, /* OS_IO_EXTI4           10 EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1   11 DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12 DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13 DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14 DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15 DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16 DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17 DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL,
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_USB_HP_CAN1_TX 19 USB Device High Priority or CAN1 TX */
      #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
         NULL, /* OS_IO_USB_HP         19 USB Device High Priority */
      #endif
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
         NULL, /* OS_IO_USB_LP_CAN1_RX0 20 USB Device Low Priority or CAN1 RX0 */
      #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
         NULL, /* OS_IO_USB_LP          20 USB Device Low Priority */
      #else
         NULL,
      #endif
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_CAN1_RX1     21 CAN1 RX1 */
      #else
         NULL,
      #endif
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_CAN1_SCE     22 CAN1 SCE */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_EXTI9_5         23 External line [9:5] */
      #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_TIM1_BRK     24 TIM1 break */
         NULL, /* OS_IO_TIM1_UP      25 TIM1 update */
         NULL, /* OS_IO_TIM1_TRG_COM 26 TIM1 Trigger and Commutation */
         NULL, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
      #else
         NULL,
         NULL,
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_TIM2            28 TIM2 global */
      NULL, /* OS_IO_TIM3            29 TIM3 global */
      #if defined(STM32F102X8_XB) || defined(STM32F103T8_TB) || \
          defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_TIM4         30 TIM4 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_I2C1_EV         31 I2C1 event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 error */
      #if defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB)
         NULL, /* OS_IO_I2C2_EV      33 I2C2 event */
         NULL, /* OS_IO_I2C2_ER      34 I2C2 error */
      #else
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_SPI1            35 SPI1 global */
      #if defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
         NULL, /* OS_IO_SPI2         36 SPI2 global */
      #else
        NULL,
      #endif
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      #if defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
         NULL, /* OS_IO_USART3       39 USART3 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_EXTI15_10       40 External line [15:10] */
      NULL, /* OS_IO_RTCAlarm        41 RTC alarm through EXTI line */
      NULL  /* OS_IO_USBWakeUp       42 USB device wakeup from suspend through EXTI line */
   };
#elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB)
   static TIMERSELECT Timer15ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014000},0x80};
   static TIMERSELECT Timer16ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014400},0x01};
   static TIMERSELECT Timer17ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014800},0x40};
   void *_OSTabDevice[56] = {
      NULL, /* OS_IO_WWDG             0 Window watchDog */
      NULL, /* OS_IO_PVD              1 Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMPER           2 Tamper */
      NULL, /* OS_IO_RTC              3 RTC global */
      NULL, /* OS_IO_FLASH            4 Flash global */
      NULL, /* OS_IO_RCC              5 RCC global */
      NULL, /* OS_IO_EXTI0            6 EXTI line 0 */
      NULL, /* OS_IO_EXTI1            7 EXTI line 1 */
      NULL, /* OS_IO_EXTI2            8 EXTI line 2 */
      NULL, /* OS_IO_EXTI3            9 EXTI line 3 */
      NULL, /* OS_IO_EXTI4           10 EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1   11 DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12 DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13 DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14 DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15 DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16 DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17 DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_EXTI9_5         23 External line [9:5] */
      Timer15ISRSelect, /* OS_IO_TIM1_BRK_TIM15     24 TIM1 Break and TIM15 */
      Timer16ISRSelect, /* OS_IO_TIM1_UP_TIM16      25 TIM1 Update and TIM16 */
      Timer17ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM17 26 TIM1 Trigger and Commutation and TIM17 */
      NULL, /* OS_IO_TIM1_CC         27 TIM1 Capture Compare */
      NULL, /* OS_IO_TIM2            28 TIM2 global */
      NULL, /* OS_IO_TIM3            29 TIM3 global */
      #if defined (STM32F100X8_XB)
         NULL, /* OS_IO_TIM4         30 TIM4 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_I2C1_EV         31 I2C1 event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 error */
      #if defined(STM32F100X8_XB)
         NULL, /* OS_IO_I2C2_EV      33 I2C2 event */
         NULL, /* OS_IO_I2C2_ER      34 I2C2 error */
      #else
         NULL,
         NULL,
      #endif
         NULL, /* OS_IO_SPI1         35 SPI1 global */
      #if defined(STM32F100X8_XB)
         NULL, /* OS_IO_SPI2         36 SPI2 global */
      #else
         NULL,
      #endif
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      #if defined(STM32F100X8_XB)
          NULL, /* OS_IO_USART3      39 USART3 global */
      #else
          NULL,
      #endif
      NULL, /* OS_IO_EXTI15_10       40 External line [15:10] */
      NULL, /* OS_IO_RTCAlarm        41 RTC alarm through EXTI line */
      NULL, /* OS_IO_CEC             42 HDMI-CEC */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_TIM6_DAC        54 TIM6 and DAC underrun */
      NULL, /* OS_IO_TIM7            55 TIM7 */
   };
#elif defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
   #if defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
      static TIMERSELECT Timer9ISRSelect  = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014C00},0x80};
      static TIMERSELECT Timer10ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40015000},0x01};
      static TIMERSELECT Timer11ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40015400},0x40};
      static TIMERSELECT Timer12ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40013400,0x40001800},0x80};
      static TIMERSELECT Timer13ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40013400,0x40001C00},0x01};
