beber007/zottaos/ZottaOS/CORTEX-Mx/STM32/ZottaOS_Interrupts.c
      static TIMERSELECT Timer14ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40013400,0x40002000},0x40};
   #endif
   void *_OSTabDevice[60] = {
      NULL, /* OS_IO_WWDG             0 Window watchDog */
      NULL, /* OS_IO_PVD              1 Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMPER           2 Tamper */
      NULL, /* OS_IO_RTC              3 RTC global */
      NULL, /* OS_IO_FLASH            4 Flash global */
      NULL, /* OS_IO_RCC              5 RCC global */
      NULL, /* OS_IO_EXTI0            6 EXTI line 0 */
      NULL, /* OS_IO_EXTI1            7 EXTI line 1 */
      NULL, /* OS_IO_EXTI2            8 EXTI line 2 */
      NULL, /* OS_IO_EXTI3            9 EXTI line 3 */
      NULL, /* OS_IO_EXTI4           10 EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1   11 DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12 DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13 DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14 DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15 DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16 DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17 DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL, /* OS_IO_USB_HP_CAN1_TX  19 USB device high priority or CAN1 TX */
      NULL, /* OS_IO_USB_LP_CAN1_RX0 20 USB device low priority or CAN1 RX0 */
      NULL, /* OS_IO_CAN1_RX1        21 CAN1 RX1 */
      NULL, /* OS_IO_CAN1_SCE        22 CAN1 SCE */
      NULL, /* OS_IO_EXTI9_5         23 External line [9:5] */
      #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE)
         NULL, /* OS_IO_TIM1_BRK     24 TIM1 Break */
         NULL, /* OS_IO_TIM1_UP      25 TIM1 Update */
         NULL, /* OS_IO_TIM1_TRG_COM 26 TIM1 Trigger and Commutation */
         NULL, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
      #elif defined (STM32F101RF_RG)|| defined(STM32F101VF_VG_ZF_ZG)
         NULL, /* OS_IO_TIM9         24 TIM9 global */
         NULL, /* OS_IO_TIM10        25 TIM10 global */
         NULL, /* OS_IO_TIM11        26 TIM11 */
         NULL,
      #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
         Timer9ISRSelect,  /* OS_IO_TIM1_BRK_TIM9      24 TIM1 Break  and TIM9 global */
         Timer10ISRSelect, /* OS_IO_TIM1_UP_TIM10      25 TIM1 Update and TIM10 global */
         Timer11ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM11 26 TIM1 Trigger and Commutation  and TIM11 */
         NULL, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
      #else
         NULL,
         NULL,
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_TIM2            28 TIM2 global */
      NULL, /* OS_IO_TIM3            29 TIM3 global */
      NULL, /* OS_IO_TIM4            30 TIM4 global */
      NULL, /* OS_IO_I2C1_EV         31 I2C1 event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 error */
      NULL, /* OS_IO_I2C2_EV         33 I2C2 event */
      NULL, /* OS_IO_I2C2_ER         34 I2C2 error */
      NULL, /* OS_IO_SPI1            35 SPI1 global */
      NULL, /* OS_IO_SPI2            36 SPI2 global */
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      NULL, /* OS_IO_USART3          39 USART3 global */
      NULL, /* OS_IO_EXTI15_10       40 External line [15:10] */
      NULL, /* OS_IO_RTCAlarm        41 RTC alarm through EXTI line */
      NULL, /* OS_IO_USBWakeUp       42 USB device wakeup from suspend through EXTI line */
      #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE)
         NULL, /* OS_IO_TIM8_BRK     43 TIM8 Break */
         NULL, /* OS_IO_TIM8_UP      44 TIM8 Update */
         NULL, /* OS_IO_TIM8_TRG_COM 45 TIM8 Trigger and Commutation */
         NULL, /* OS_IO_TIM8_CC      46 TIM8 Capture Compare */
      #elif defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG)
         NULL, /* OS_IO_TIM12        43 TIM12 global */
         NULL, /* OS_IO_TIM13        44 TIM13 global */
         NULL, /* OS_IO_TIM14        45 TIM14 global */
         NULL,
      #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
         Timer12ISRSelect, /* OS_IO_TIM8_BRK_TIM12     43 TIM8 Break and TIM12 global */
         Timer13ISRSelect, /* OS_IO_TIM8_UP_TIM13      44 TIM8 Update and TIM13 global */
         Timer14ISRSelect, /* OS_IO_TIM8_TRG_COM_TIM14 45 TIM8 Trigger and Commutation  and TIM14 global */
         NULL, /* OS_IO_TIM8_CC      46 TIM8 Capture Compare */
      #else
         NULL,
         NULL,
         NULL,
         NULL,
      #endif
      NULL, /* OS_IO_ADC3            47 ADC3 global */
      NULL, /* OS_IO_FSMC            48 FSMC global */
      NULL, /* OS_IO_SDIO            49 SDIO global */
      NULL, /* OS_IO_TIM5            50 TIM5 global */
      NULL, /* OS_IO_SPI3            51 SPI3 global */
      NULL, /* OS_IO_UART4           52 UART4 global */
      NULL, /* OS_IO_UART5           53 UART5 global */
      NULL, /* OS_IO_TIM6            54 TIM6 global */
      NULL, /* OS_IO_TIM7            55 TIM7 */
      NULL, /* OS_IO_DMA2_Channel1   56 DMA2 channel 1 global */
      NULL, /* OS_IO_DMA2_Channel2   57 DMA2 channel 2 global */
      NULL, /* OS_IO_DMA2_Channel3   58 DMA2 channel 3 global */
      NULL  /* OS_IO_DMA2_Channel4_5 59 DMA2 channels 4 and 5 global */
   };
#elif defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
   static TIMERSELECT Timer15ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014000},0x80};
   static TIMERSELECT Timer16ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014400},0x01};
   static TIMERSELECT Timer17ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40012C00,0x40014800},0x40};
   void *_OSTabDevice[61] = {
      NULL, /* OS_IO_WWDG             0  Window watchDog */
      NULL, /* OS_IO_PVD              1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMPER           2  Tamper*/
      NULL, /* OS_IO_RTC              3  RTC global */
      NULL, /* OS_IO_FLASH            4  Flash global */
      NULL, /* OS_IO_RCC              5  RCC global */
      NULL, /* OS_IO_EXTI0            6  EXTI line 0 */
      NULL, /* OS_IO_EXTI1            7  EXTI line 1 */
      NULL, /* OS_IO_EXTI2            8  EXTI line 2 */
      NULL, /* OS_IO_EXTI3            9  EXTI line 3 */
      NULL, /* OS_IO_EXTI4           10  EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1   11  DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2   12  DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3   13  DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4   14  DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5   15  DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6   16  DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7   17  DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1            18 ADC1 global */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_EXTI9_5         23 External line [9:5] */
      Timer15ISRSelect, /* OS_IO_TIM1_BRK_TIM15     24 TIM1 Break and TIM15 */
      Timer16ISRSelect, /* OS_IO_TIM1_UP_TIM16      25 TIM1 Update and TIM16 */
      Timer17ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM17 26 TIM1 Trigger and Commutation and TIM17 */
      NULL, /* OS_IO_TIM1_CC         27 TIM1 Capture Compare */
      NULL, /* OS_IO_TIM2            28 TIM2 global */
      NULL, /* OS_IO_TIM3            29 TIM3 global */
      NULL, /* OS_IO_TIM4            30 TIM4 global */
      NULL, /* OS_IO_I2C1_EV         31 I2C1 event */
      NULL, /* OS_IO_I2C1_ER         32 I2C1 error */
      NULL, /* OS_IO_I2C2_EV         33 I2C2 event */
      NULL, /* OS_IO_I2C2_ER         34 I2C2 error */
      NULL, /* OS_IO_SPI1            35 SPI1 global */
      NULL, /* OS_IO_SPI2            36 SPI2 global */
      NULL, /* OS_IO_USART1          37 USART1 global */
      NULL, /* OS_IO_USART2          38 USART2 global */
      NULL, /* OS_IO_USART3          39 USART3 global */
      NULL, /* OS_IO_EXTI15_10       40 External line [15:10] */
      NULL, /* OS_IO_RTCAlarm        41 RTC alarm through EXTI line */
      NULL, /* OS_IO_CEC             42 HDMI-CEC */
      NULL, /* OS_IO_TIM12           43 TIM12 global */
      NULL, /* OS_IO_TIM13           44 TIM13 global */
      NULL, /* OS_IO_TIM14           45 TIM14 global */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_TIM5            50 TIM5 global */
      NULL, /* OS_IO_SPI3            51 SPI3 global */
      NULL, /* OS_IO_UART4           52 UART4 global */
      NULL, /* OS_IO_UART5           53 UART5 global */
      NULL, /* OS_IO_TIM6_DAC        54 TIM6 and DAC underrun */
      NULL, /* OS_IO_TIM7            55 TIM7 */
      NULL, /* OS_IO_DMA2_Channel1   56 DMA2 channel 1 global */
      NULL, /* OS_IO_DMA2_Channel2   57 DMA2 channel 2 global */
      NULL, /* OS_IO_DMA2_Channel3   58 DMA2 channel 3 global */
      NULL, /* OS_IO_DMA2_Channel4_5 59 DMA2 channels 4 and 5 global */
      NULL, /* OS_IO_DMA2_Channel5   60 DMA2 channel 5 global  (DMA2 Channel 5 is mapped
                                        at position 60 only if the MISC_REMAP bit in the
                                        AFIO_MAPR2 register is set) */
   };
#elif defined(STM32F105XX) || defined(STM32F107XX)
   void *_OSTabDevice[68] = {
      NULL, /* OS_IO_WWDG           0 Window watchDog */
      NULL, /* OS_IO_PVD            1 Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMPER         2 Tamper */
      NULL, /* OS_IO_RTC            3 RTC global */
      NULL, /* OS_IO_FLASH          4 Flash global */
      NULL, /* OS_IO_RCC            5 RCC global */
      NULL, /* OS_IO_EXTI0          6 EXTI line 0 */
      NULL, /* OS_IO_EXTI1          7 EXTI line 1 */
      NULL, /* OS_IO_EXTI2          8 EXTI line 2 */
      NULL, /* OS_IO_EXTI3          9 EXTI line 3 */
      NULL, /* OS_IO_EXTI4         10 EXTI line 4 */
      NULL, /* OS_IO_DMA1_Channel1 11 DMA1 channel 1 global */
      NULL, /* OS_IO_DMA1_Channel2 12 DMA1 channel 2 global */
      NULL, /* OS_IO_DMA1_Channel3 13 DMA1 channel 3 global */
      NULL, /* OS_IO_DMA1_Channel4 14 DMA1 channel 4 global */
      NULL, /* OS_IO_DMA1_Channel5 15 DMA1 channel 5 global */
      NULL, /* OS_IO_DMA1_Channel6 16 DMA1 channel 6 global */
      NULL, /* OS_IO_DMA1_Channel7 17 DMA1 channel 7 global */
      NULL, /* OS_IO_ADC1_2        18 ADC1 and ADC2 global */
      NULL, /* OS_IO_CAN1_TX       19 CAN1 TX */
      NULL, /* OS_IO_CAN1_RX0      20 CAN1 RX0 */
      NULL, /* OS_IO_CAN1_RX1      21 CAN1 RX1 */
      NULL, /* OS_IO_CAN1_SCE      22 CAN1 SCE */
      NULL, /* OS_IO_EXTI9_5       23 External line [9:5] */
      NULL, /* OS_IO_TIM1_BRK      24 TIM1 Break */
      NULL, /* OS_IO_TIM1_UP       25 TIM1 Update */
      NULL, /* OS_IO_TIM1_TRG_COM  26 TIM1 Trigger and Commutation */
      NULL, /* OS_IO_TIM1_CC       27 TIM1 Capture Compare */
      NULL, /* OS_IO_TIM2          28 TIM2 global */
      NULL, /* OS_IO_TIM3          29 TIM3 global */
      NULL, /* OS_IO_TIM4          30 TIM4 global */
      NULL, /* OS_IO_I2C1_EV       31 I2C1 event */
      NULL, /* OS_IO_I2C1_ER       32 I2C1 error */
      NULL, /* OS_IO_I2C2_EV       33 I2C2 event */
      NULL, /* OS_IO_I2C2_ER       34 I2C2 error */
      NULL, /* OS_IO_SPI1          35 SPI1 global */
      NULL, /* OS_IO_SPI2          36 SPI2 global */
      NULL, /* OS_IO_USART1        37 USART1 global */
      NULL, /* OS_IO_USART2        38 USART2 global */
      NULL, /* OS_IO_USART3        39 USART3 global */
      NULL, /* OS_IO_EXTI15_10     40 External line[ 15:10] */
      NULL, /* OS_IO_RTCAlarm      41 RTC alarm through EXTI line */
      NULL, /* OS_IO_OTG_FS_WKUP   42 USB OTG FS wakeup from suspend through EXTI line */
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL,
      NULL, /* OS_IO_TIM5          50 TIM5 global */
      NULL, /* OS_IO_SPI3          51 SPI3 global */
      NULL, /* OS_IO_UART4         52 UART4 global */
      NULL, /* OS_IO_UART5         53 UART5 global */
      NULL, /* OS_IO_TIM6          54 TIM6 global */
      NULL, /* OS_IO_TIM7          55 TIM7 */
      NULL, /* OS_IO_DMA2_Channel1 56 DMA2 channel 1 global */
      NULL, /* OS_IO_DMA2_Channel2 57 DMA2 channel 2 global */
      NULL, /* OS_IO_DMA2_Channel3 58 DMA2 channel 3 global */
      NULL, /* OS_IO_DMA2_Channel4 59 DMA2 channel 4 global */
      NULL, /* OS_IO_DMA2_Channel5 60 DMA2 channel 5 global */
      NULL, /* OS_IO_ETH           61 Ethernet global */
      NULL, /* OS_IO_ETH_WKUP      62 Ethernet wakeup through EXTI line */
      NULL, /* OS_IO_CAN2_TX       63 CAN2 TX */
      NULL, /* OS_IO_CAN2_RX0      64 CAN2 RX0 */
      NULL, /* OS_IO_CAN2_RX1      65 CAN2 RX1 */
      NULL, /* OS_IO_CAN2_SCE      66 CAN2 SCE */
      NULL  /* OS_IO_OTG_FS        67 USB OTG FS global */
   };
#elif defined(STM32F2XXXX)
   static TIMERSELECT Timer9ISRSelect  = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010000,0x40014000},0x80};
   static TIMERSELECT Timer10ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010000,0x40014400},0x01};
   static TIMERSELECT Timer11ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010000,0x40014800},0x40};
   static TIMERSELECT Timer12ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010400,0x40001800},0x80};
   static TIMERSELECT Timer13ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010400,0x40001C00},0x01};
   static TIMERSELECT Timer14ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010400,0x40002000},0x40};
   void *_OSTabDevice[81] = {
      NULL, /* OS_IO_WWDG             0  Window watchdog */
      NULL, /* OS_IO_PVD              1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMP_STAMP       2  Tamper and TimeStamp through the EXTI line*/
      NULL, /* OS_IO_RTC_WKUP         3  RTC wakeup through the EXTI line */
      NULL, /* OS_IO_FLASH            4  Flash global */
      NULL, /* OS_IO_RCC              5  RCC global */
      NULL, /* OS_IO_EXTI0            6  EXTI line 0 */
      NULL, /* OS_IO_EXTI1            7  EXTI line 1 */
      NULL, /* OS_IO_EXTI2            8  EXTI line 2 */
      NULL, /* OS_IO_EXTI3            9  EXTI line 3 */
      NULL, /* OS_IO_EXTI4           10  EXTI line 4 */
      NULL, /* OS_IO_DMA1_Stream0    11  DMA1 stream 0 global */
      NULL, /* OS_IO_DMA1_Stream1    12  DMA1 stream 1 global */
      NULL, /* OS_IO_DMA1_Stream2    13  DMA1 stream 2 global */
      NULL, /* OS_IO_DMA1_Stream3    14  DMA1 stream 3 global */
      NULL, /* OS_IO_DMA1_Stream4    15  DMA1 stream 4 global */
      NULL, /* OS_IO_DMA1_Stream5    16  DMA1 stream 5 global */
      NULL, /* OS_IO_DMA1_Stream6    17  DMA1 stream 6 global */
      NULL,  /* OS_IO_ADC            18  ADC1, ADC2 and ADC3 global */
      NULL,  /* OS_IO_CAN1_TX        19  CAN1 TX */
      NULL,  /* OS_IO_CAN1_RX0       20  CAN1 RX0 */
      NULL,  /* OS_IO_CAN1_RX1       21  CAN1 RX1 */
      NULL,  /* OS_IO_CAN1_SCE       22  CAN1 SCE */
      NULL,  /* OS_IO_EXTI9_5        23  External line [9:5] */
      &Timer9ISRSelect,  /* OS_IO_TIM1_BRK_TIM9      24  TIM1 Break and TIM9 global */
      &Timer10ISRSelect, /* OS_IO_TIM1_UP_TIM10      25  TIM1 Update and TIM10 global */
      &Timer11ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM11 26  TIM1 Trigger and Commutation and TIM11 global */
      NULL,  /* OS_IO_TIM1_CC        27  TIM1 Capture Compare */
      NULL,  /* OS_IO_TIM2           28  TIM2 global */
      NULL,  /* OS_IO_TIM3           29  TIM3 global */
      NULL,  /* OS_IO_TIM4           30  TIM4 global */
      NULL,  /* OS_IO_I2C1_EV        31  I2C1 event */
      NULL,  /* OS_IO_I2C1_ER        32  I2C1 error */
      NULL,  /* OS_IO_I2C2_EV        33  I2C2 event */
      NULL,  /* OS_IO_I2C2_ER        34  I2C2 error */
      NULL,  /* OS_IO_SPI1           35  SPI1 global */
      NULL,  /* OS_IO_SPI2           36  SPI2 global */
      NULL,  /* OS_IO_USART1         37  USART1 global */
      NULL,  /* OS_IO_USART2         38  USART2 global */
      NULL,  /* OS_IO_USART3         39  USART3 global */
      NULL,  /* OS_IO_EXTI15_10      40  External line [15:10] */
      NULL,  /* OS_IO_RTC_Alarm      41  RTC alarm (A and B) through EXTI line */
      NULL,  /* OS_IO_OTG_FS_WKUP    42  USB OTG FS Wakeup through EXTI line */
      &Timer12ISRSelect, /* OS_IO_TIM8_BRK_TIM12     43  TIM8 Break and TIM12 global */
      &Timer13ISRSelect, /* OS_IO_TIM8_UP_TIM13      44  TIM8 Update and TIM13 global */
      &Timer14ISRSelect, /* OS_IO_TIM8_TRG_COM_TIM14 45  TIM8 Trigger and Commutation and TIM14 global */
      NULL,  /* OS_IO_TIM8_CC        46  TIM8 Capture Compare */
      NULL,  /* OS_IO_DMA1_Stream7   47  DMA1 stream 7 */
      NULL,  /* OS_IO_FSMC           48  FSMC global */
      NULL,  /* OS_IO_SDIO           49  SDIO global */
      NULL,  /* OS_IO_TIM5           50  TIM5 global */
      NULL,  /* OS_IO_SPI3           51  SPI3 global */
      NULL,  /* OS_IO_UART4          52  UART4 global */
      NULL,  /* OS_IO_UART5          53  UART5 global */
      NULL,  /* OS_IO_TIM6_DAC       54  TIM6 global and DAC 1 & 2 underrun error */
      NULL,  /* OS_IO_TIM7           55  TIM7 global */
      NULL,  /* OS_IO_DMA2_Stream0   56  DMA2 stream 0 global */
      NULL,  /* OS_IO_DMA2_Stream1   57  DMA2 stream 1 global */
      NULL,  /* OS_IO_DMA2_Stream2   58  DMA2 stream 2 global */
      NULL,  /* OS_IO_DMA2_Stream3   59  DMA2 stream 3 global */
      NULL,  /* OS_IO_DMA2_Stream4   60  DMA2 stream 4 global */
      NULL,  /* OS_IO_ETH            61  Ethernet global */
      NULL,  /* OS_IO_ETH_WKUP       62  Ethernet wakeup through EXTI line */
      NULL,  /* OS_IO_CAN2_TX        63  CAN2 TX */
      NULL,  /* OS_IO_CAN2_RX0       64  CAN2 RX0 */
      NULL,  /* OS_IO_CAN2_RX1       65  CAN2 RX1 */
      NULL,  /* OS_IO_CAN2_SCE       66  CAN2 SCE */
      NULL,  /* OS_IO_OTG_FS         67  USB OTG FS global */
      NULL,  /* OS_IO_DMA2_Stream5   68  DMA2 stream 5 global */
      NULL,  /* OS_IO_DMA2_Stream6   69  DMA2 stream 6 global */
      NULL,  /* OS_IO_DMA2_Stream7   70  DMA2 stream 7 global */
      NULL,  /* OS_IO_USART6         71  USART6 global */
      NULL,  /* OS_IO_I2C3_EV        72  I2C3 event */
      NULL,  /* OS_IO_I2C3_ER        73  I2C3 error */
      NULL,  /* OS_IO_OTG_HS_EP1_OUT 74  USB OTG HS End Point 1 Out global */
      NULL,  /* OS_IO_OTG_HS_EP1_IN  75  USB OTG HS End Point 1 In global */
      NULL,  /* OS_IO_OTG_HS_WKUP    76  USB OTG HS Wakeup through EXTI */
      NULL,  /* OS_IO_OTG_HS         77  USB OTG HS global */
      NULL,  /* OS_IO_DCMI           78  DCMI global */
      NULL,  /* OS_IO_CRYP           79  CRYP crypto global */
      NULL   /* OS_IO_HASH_RNG       80  Hash and Rng global */
   };
#elif defined(STM32F4XXXX)
   static TIMERSELECT Timer9ISRSelect  = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010000,0x40014000},0x80};
   static TIMERSELECT Timer10ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010000,0x40014400},0x01};
   static TIMERSELECT Timer11ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010000,0x40014800},0x40};
   static TIMERSELECT Timer12ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010400,0x40001800},0x80};
   static TIMERSELECT Timer13ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010400,0x40001C00},0x01};
   static TIMERSELECT Timer14ISRSelect = {_OSTimerSelectorHandler,{NULL,NULL},{0x40010400,0x40002000},0x40};
   void *_OSTabDevice[82] = {
      NULL, /* OS_IO_WWDG             0  Window watchDog */
      NULL, /* OS_IO_PVD              1  Programmable voltage detector through EXTI line */
      NULL, /* OS_IO_TAMP_STAMP       2  Tamper and TimeStamp through the EXTI line*/
      NULL, /* OS_IO_RTC_WKUP         3  RTC wakeup through the EXTI line */
      NULL, /* OS_IO_FLASH            4  Flash global */
      NULL, /* OS_IO_RCC              5  RCC global */
      NULL, /* OS_IO_EXTI0            6  EXTI line 0 */
      NULL, /* OS_IO_EXTI1            7  EXTI line 1 */
      NULL, /* OS_IO_EXTI2            8  EXTI line 2 */
      NULL, /* OS_IO_EXTI3            9  EXTI line 3 */
      NULL, /* OS_IO_EXTI4           10  EXTI line 4 */
      NULL, /* OS_IO_DMA1_Stream0    11  DMA1 stream 0 global */
      NULL, /* OS_IO_DMA1_Stream1    12  DMA1 stream 1 global */
      NULL, /* OS_IO_DMA1_Stream2    13  DMA1 stream 2 global */
      NULL, /* OS_IO_DMA1_Stream3    14  DMA1 stream 3 global */
      NULL, /* OS_IO_DMA1_Stream4    15  DMA1 stream 4 global */
      NULL, /* OS_IO_DMA1_Stream5    16  DMA1 stream 5 global */
      NULL, /* OS_IO_DMA1_Stream6    17  DMA1 stream 6 global */
      NULL,  /* OS_IO_ADC            18  ADC1, ADC2 and ADC3 global */
      NULL,  /* OS_IO_CAN1_TX        19  CAN1 TX */
      NULL,  /* OS_IO_CAN1_RX0       20  CAN1 RX0 */
      NULL,  /* OS_IO_CAN1_RX1       21  CAN1 RX1 */
      NULL,  /* OS_IO_CAN1_SCE       22  CAN1 SCE */
      NULL,  /* OS_IO_EXTI9_5        23  External Line[9:5]  */
      &Timer9ISRSelect,  /* OS_IO_TIM1_BRK_TIM9      24  TIM1 Break and TIM9 global */
      &Timer10ISRSelect, /* OS_IO_TIM1_UP_TIM10      25  TIM1 Update and TIM10 global */
      &Timer11ISRSelect, /* OS_IO_TIM1_TRG_COM_TIM11 26  TIM1 Trigger and Commutation and TIM11 global */
      NULL,  /* OS_IO_TIM1_CC        27  TIM1 Capture Compare */
      NULL,  /* OS_IO_TIM2           28  TIM2 global */
      NULL,  /* OS_IO_TIM3           29  TIM3 global */
      NULL,  /* OS_IO_TIM4           30  TIM4 global */
      NULL,  /* OS_IO_I2C1_EV        31  I2C1 event */
      NULL,  /* OS_IO_I2C1_ER        32  I2C1 error */
      NULL,  /* OS_IO_I2C2_EV        33  I2C2 event */
      NULL,  /* OS_IO_I2C2_ER        34  I2C2 error */
      NULL,  /* OS_IO_SPI1           35  SPI1 global */
      NULL,  /* OS_IO_SPI2           36  SPI2 global */
      NULL,  /* OS_IO_USART1         37  USART1 global */
      NULL,  /* OS_IO_USART2         38  USART2 global */
      NULL,  /* OS_IO_USART3         39  USART3 global */
      NULL,  /* OS_IO_EXTI15_10      40  External line [15:10] */
      NULL,  /* OS_IO_RTC_Alarm      41  RTC alarm (A and B) through EXTI line */
      NULL,  /* OS_IO_OTG_FS_WKUP    42  USB OTG FS wakeup through EXTI line */
      &Timer12ISRSelect, /* OS_IO_TIM8_BRK_TIM12     43  TIM8 Break and TIM12 global */
      &Timer13ISRSelect, /* OS_IO_TIM8_UP_TIM13      44  TIM8 Update and TIM13 global */
      &Timer14ISRSelect, /* OS_IO_TIM8_TRG_COM_TIM14 45  TIM8 Trigger and Commutation and TIM14 global */
      NULL,  /* OS_IO_TIM8_CC        46  TIM8 Capture Compare */
      NULL,  /* OS_IO_DMA1_Stream7   47  DMA1 Stream7 */
      NULL,  /* OS_IO_FSMC           48  FSMC global */
      NULL,  /* OS_IO_SDIO           49  SDIO global */
      NULL,  /* OS_IO_TIM5           50  TIM5 global */
      NULL,  /* OS_IO_SPI3           51  SPI3 global */
      NULL,  /* OS_IO_UART4          52  UART4 global */
      NULL,  /* OS_IO_UART5          53  UART5 global */
      NULL,  /* OS_IO_TIM6_DAC       54  TIM6 global and DAC1&2 underrun error */
      NULL,  /* OS_IO_TIM7           55  TIM7 global */
      NULL,  /* OS_IO_DMA2_Stream0   56  DMA2 Stream 0 global */
      NULL,  /* OS_IO_DMA2_Stream1   57  DMA2 Stream 1 global */
      NULL,  /* OS_IO_DMA2_Stream2   58  DMA2 Stream 2 global */
      NULL,  /* OS_IO_DMA2_Stream3   59  DMA2 Stream 3 global */
      NULL,  /* OS_IO_DMA2_Stream4   60  DMA2 Stream 4 global */
      NULL,  /* OS_IO_ETH            61  Ethernet global */
      NULL,  /* OS_IO_ETH_WKUP       62  Ethernet Wakeup through EXTI line */
      NULL,  /* OS_IO_CAN2_TX        63  CAN2 TX */
      NULL,  /* OS_IO_CAN2_RX0       64  CAN2 RX0 */
      NULL,  /* OS_IO_CAN2_RX1       65  CAN2 RX1 */
      NULL,  /* OS_IO_CAN2_SCE       66  CAN2 SCE */
