beber007/zottaos/ZottaOS/CORTEX-Mx/STM32/ZottaOS_Interrupts.c
      NULL,  /* OS_IO_OTG_FS         67  USB OTG FS global */
      NULL,  /* OS_IO_DMA2_Stream5   68  DMA2 Stream 5 global */
      NULL,  /* OS_IO_DMA2_Stream6   69  DMA2 Stream 6 global */
      NULL,  /* OS_IO_DMA2_Stream7   70  DMA2 Stream 7 global */
      NULL,  /* OS_IO_USART6         71  USART6 global */
      NULL,  /* OS_IO_I2C3_EV        72  I2C3 event */
      NULL,  /* OS_IO_I2C3_ER        73  I2C3 error */
      NULL,  /* OS_IO_OTG_HS_EP1_OUT 74  USB OTG HS End Point 1 Out global */
      NULL,  /* OS_IO_OTG_HS_EP1_IN  75  USB OTG HS End Point 1 In global */
      NULL,  /* OS_IO_OTG_HS_WKUP    76  USB OTG HS wakeup through EXTI */
      NULL,  /* OS_IO_OTG_HS         77  USB OTG HS global */
      NULL,  /* OS_IO_DCMI           78  DCMI global */
      NULL,  /* OS_IO_CRYP           79  CRYP crypto global */
      NULL,  /* OS_IO_HASH_RNG       80  Hash and Rng global */
      NULL   /* OS_IO_FPU            81  FPU global */
   };
#else
  #error STM32 version undefined
#endif


#ifdef DEBUG_MODE
/* UndefinedInterrupt: Dummy ISR to fall into an infinite loop when referring to an in-
** existent entry of the interrupt vector table. */
static void UndefinedInterrupt(void)
{
  UINT32 intNum;
  _OSDisableInterrupts();
  intNum  = (*((UINT32 *)0xE000ED04) & 0x1FF);
  intNum  -= 16;
  while (TRUE); // referring to an inexistent entry of the interrupt vector table.
} /* end of undefinedInterrupt */
#endif


/* STM32 specific interrupt vector table, which is added by the linker at the end of table
** CortexM3VectorTable which is defined in ZottaOS_CortexM3.c. */
__attribute__ ((section(".isr_vector_specific")))
void (* const STM32VectorTable[])(void) =
{
  _OSIOHandler, /* OS_IO_WWDG                   0  Window watchDog */
  _OSIOHandler, /* OS_IO_PVD                    1  Programmable voltage detector through EXTI line */
#if defined(STM32F05XXX)
  _OSIOHandler, /* OS_IO_RTC                    2  RTC through EXTI line */
  _OSIOHandler, /* OS_IO_FLASH                  3  Flash */
#elif defined(STM32L1XXXX) || defined(STM32F2XXXX) || defined(STM32F4XXXX)
  _OSIOHandler, /* OS_IO_TAMP_STAMP             2  Tamper and TimeStamp through the EXTI
                                                   line*/
  _OSIOHandler, /* OS_IO_RTC_WKUP               3  RTC wakeup through the EXTI line */
#elif defined(STM32F1XXXX)
  _OSIOHandler, /* OS_IO_TAMPER                 2  Tamper*/
  _OSIOHandler, /* OS_IO_RTC                    3  RTC global */
#else
   #error STM32 version undefined
#endif
#if defined(STM32F05XXX)
  _OSIOHandler, /* OS_IO_RCC                    4  RCC */
  _OSIOHandler, /* OS_IO_EXTI0_1                5  EXTI line 0 and 1 */
  _OSIOHandler, /* OS_IO_EXTI2_3                6  EXTI line 2 and 3 */
  _OSIOHandler, /* OS_IO_EXTI4_15               7  EXTI line 4 to 15 */
  _OSIOHandler, /* OS_IO_TS                     8  TS */
  _OSIOHandler, /* OS_IO_DMA1_Channel1          9  DMA1 channel 1 */
  _OSIOHandler, /* OS_IO_DMA1_Channel2_3       10  DMA1 channel 2 and Channel 3 */
#elif defined(STM32L1XXXX) || defined(STM32F1XXXX) || defined(STM32F2XXXX) || defined(STM32F4XXXX)
  _OSIOHandler, /* OS_IO_FLASH                  4  Flash global */
  _OSIOHandler, /* OS_IO_RCC                    5  RCC global */
  _OSIOHandler, /* OS_IO_EXTI0                  6  EXTI line 0 */
  _OSIOHandler, /* OS_IO_EXTI1                  7  EXTI line 1 */
  _OSIOHandler, /* OS_IO_EXTI2                  8  EXTI line 2 */
  _OSIOHandler, /* OS_IO_EXTI3                  9  EXTI line 3 */
  _OSIOHandler, /* OS_IO_EXTI4                 10  EXTI line 4 */
#else
   #error STM32 version undefined
#endif
#if defined(STM32F05XXX)
  _OSIOHandler, /* OS_IO_DMA1_Channel4_5       11  DMA1 channels 4 and 5 */
  _OSIOHandler, /* ADC1_COMP                   12  ADC1, COMP1 and COMP2 */
  _OSIOHandler, /* TIM1_BRK_UP_TRG_COM         13  TIM1 Break, Update, Trigger and Commutation */
  _OSIOHandler, /* TIM1_CC                     14  TIM1 Capture Compare */
  _OSIOHandler, /* TIM2                        15  TIM2 */
  _OSIOHandler, /* TIM3                        16  TIM3 */
  #if defined(STM32F051X4) || defined(STM32F051K6_K8_C6_R6) || defined(STM32F051C8_R8)
     _OSIOHandler, /* TIM6_DAC                 17  TIM6 and DAC */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
#elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
  _OSIOHandler, /* OS_IO_DMA1_Stream0          11  DMA1 stream 0 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream1          12  DMA1 stream 1 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream2          13  DMA1 stream 2 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream3          14  DMA1 stream 3 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream4          15  DMA1 stream 4 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream5          16  DMA1 stream 5 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream6          17  DMA1 stream 6 global */
#elif defined(STM32L1XXXX) || defined(STM32F1XXXX)
  _OSIOHandler, /* OS_IO_DMA1_Channel1         11  DMA1 channel 1 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel2         12  DMA1 channel 2 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel3         13  DMA1 channel 3 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel4         14  DMA1 channel 4 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel5         15  DMA1 channel 5 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel6         16  DMA1 channel 6 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel7         17  DMA1 channel 7 global */
#else
   #error STM32 version undefined
#endif
/* ------------------------------ STM32F0 --------------------------------------------- */
#if defined(STM32F05XXX)
  #if defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_TIM14                 19 TIM14 */
  #if defined(STM32F051X4) || defined(STM32F051K6_K8_C6_R6) || defined(STM32F051C8_R8)
     _OSIOHandler, /* OS_IO_TIM15              20 TIM15 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_TIM16                 21 TIM16 */
  _OSIOHandler, /* OS_IO_TIM17                 22 TIM17 */
  _OSIOHandler, /* OS_IO_I2C1                  23 I2C1 */
  #if defined(STM32F051C8_R8)
     _OSIOHandler, /* OS_IO_I2C2               24 I2C2 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_SPI1                  25 SPI1 */
  #if defined(STM32F051C8_R8)
     _OSIOHandler, /* OS_IO_SPI2               26 SPI2 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_USART1                27 USART1 */
  #if defined(STM32F051K6_K8_C6_R6) || defined(STM32F051C8_R8)
     _OSIOHandler, /* OS_IO_USART2             28 USART2 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F051X4) || defined(STM32F051K6_K8_C6_R6) || defined(STM32F051C8_R8)
     _OSIOHandler, /* OS_IO_CEC                30 CEC */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
/* ------------------------------ STM32L1 --------------------------------------------- */
#elif defined(STM32L1XXXX)
  _OSIOHandler, /* OS_IO_ADC1                  18  ADC1 global */
  _OSIOHandler, /* OS_IO_USB_HP                19  USB high priority */
  _OSIOHandler, /* OS_IO_USB_LP                20  USB low priority */
  _OSIOHandler, /* OS_IO_DAC                   21  DAC */
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_COMP_CA            22  Comparator and Channel acquisition
                                                   through EXTI Line */
  #else
     _OSIOHandler, /* OS_IO_COMP               22  Comparator through EXTI line */
  #endif
  _OSIOHandler, /* OS_IO_EXTI9_5               23  External line [9:5] */
  #if defined(STM32L152X6_X8_XB) || defined(STM32L152XC) || defined(STM32L152XD) || \
      defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_LCD                24  LCD */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_TIM9                  25  TIM9 global */
  _OSIOHandler, /* OS_IO_TIM10                 26  TIM10 global */
  _OSIOHandler, /* OS_IO_TIM11                 27  TIM11 global */
  _OSIOHandler, /* OS_IO_TIM2                  28  TIM2 global */
  _OSIOHandler, /* OS_IO_TIM3                  29  TIM3 global */
  _OSIOHandler, /* OS_IO_TIM4                  30  TIM4 global */
  _OSIOHandler, /* OS_IO_I2C1_EV               31  I2C1 event */
  _OSIOHandler, /* OS_IO_I2C1_ER               32  I2C1 error */
  _OSIOHandler, /* OS_IO_I2C2_EV               33  I2C2 event */
  _OSIOHandler, /* OS_IO_I2C2_ER               34  I2C2 error */
  _OSIOHandler, /* OS_IO_SPI1                  35  SPI1 global */
  _OSIOHandler, /* OS_IO_SPI2                  36  SPI2 global */
  _OSIOHandler, /* OS_IO_USART1                37  USART1 global */
  _OSIOHandler, /* OS_IO_USART2                38  USART2 global */
  _OSIOHandler, /* OS_IO_USART3                39  USART3 global */
  _OSIOHandler, /* OS_IO_EXTI15_10             40  External line [15:10] */
  _OSIOHandler, /* OS_IO_RTC_Alarm             41  RTC alarm through EXTI line */
  _OSIOHandler, /* OS_IO_USB_FS_WKUP           42  USB FS wakeUp from suspend through EXTI
                                                   line */
  _OSIOHandler, /* OS_IO_TIM6                  43  TIM6 global */
  _OSIOHandler, /* OS_IO_TIM7                  44  TIM7 global */
  #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_SDIO               45  SDIO global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_TIM5               46  TIM5 global */
     _OSIOHandler, /* OS_IO_SPI3               47  SPI3 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
  #endif
  #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_UART4              48  UART4 global */
     _OSIOHandler, /* OS_IO_UART5              49  UART5 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
  #endif
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_DMA2_Channel1      50  DMA2 channel 1 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel2      51  DMA2 channel 2 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel3      52  DMA2 channel 3 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel4      53  DMA2 channel 4 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel5      54  DMA2 channel 5 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
     NULL,
     NULL,
     NULL,
  #endif
  #if defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_AES                55  AES global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_COMP_ACQ           56  Comparator channel acquisition global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
/* ------------------------------ STM32F1 --------------------------------------------- */
#elif defined(STM32F1XXXX)
  #if defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
      defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101X4_X6) || defined(STM32F101T8_TB) || \
      defined(STM32F101C8_CB_R8_RB_V8_VB) || defined(STM32F101RC_RD_RE) || \
      defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || defined(STM32F102X4_X6) || \
      defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_ADC1               18 ADC1 global */
  #elif defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
        defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
        defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F105XX) || \
        defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_ADC1_2             18 ADC1 and ADC2 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_USB_HP_CAN1_TX     19 USB device high priority or CAN1 TX */
  #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_USB_HP             19 USB device high priority */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_TX            19 CAN1 TX */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_USB_LP_CAN1_RX0    20 USB device low priority or CAN1 RX0 */
  #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_USB_LP             20 USB device low priority */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_RX0           20 CAN1 RX0 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG) || defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_RX1           21 CAN1 RX1 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG) || defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_SCE           22 CAN1 SCE */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_EXTI9_5               23 External line [9:5] */
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_TIM1_BRK           24 TIM1 Break */
     _OSIOHandler, /* OS_IO_TIM1_UP            25 TIM1 Update */
     _OSIOHandler, /* OS_IO_TIM1_TRG_COM       26 TIM1 Trigger and Commutation */
     _OSIOHandler, /* OS_IO_TIM1_CC            27 TIM1 Capture Compare */
  #elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
        defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
     _OSIOHandler, /* OS_IO_TIM1_BRK_TIM15     24 TIM1 Break and TIM15 */
     _OSIOHandler, /* OS_IO_TIM1_UP_TIM16      25 TIM1 Update and TIM16 */
     _OSIOHandler, /* OS_IO_TIM1_TRG_COM_TIM17 26 TIM1 Trigger and Commutation and TIM17 */
     _OSIOHandler, /* OS_IO_TIM1_CC            27 TIM1 Capture Compare */
  #elif defined (STM32F101RF_RG)|| defined(STM32F101VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_TIM9               24 TIM9 global */
     _OSIOHandler, /* OS_IO__TIM10             25 TIM10 global */
     _OSIOHandler, /* OS_IO_TIM11              26 TIM11 */
     #if defined(DEBUG_MODE)
        UndefinedInterrupt,
     #else
        NULL,
     #endif
  #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_TIM1_BRK_TIM9      24 TIM1 Break and TIM9 global */
     _OSIOHandler, /* OS_IO_TIM1_UP_TIM10      25 TIM1 Update and TIM10 global */
     _OSIOHandler, /* OS_IO_TIM1_TRG_COM_TIM11 26 TIM1 Trigger and Commutation and TIM11 */
     _OSIOHandler, /* OS_IO_TIM1_CC            27 TIM1 Capture Compare */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
     NULL,
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_TIM2                  28  TIM2 global */
  _OSIOHandler, /* OS_IO_TIM3                  29  TIM3 global */
  #if defined (STM32F100X8_XB) || defined (STM32F100RC_RD_RE) || \
      defined (STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101T8_TB) || \
      defined(STM32F101C8_CB_R8_RB_V8_VB) || defined(STM32F101RC_RD_RE) || \
      defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || defined(STM32F102X8_XB) || \
      defined(STM32F103T8_TB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined (STM32F101RF_RG)|| defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_TIM4               30 TIM4 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_I2C1_EV               31 I2C1 event */
  _OSIOHandler, /* OS_IO_I2C1_ER               32 I2C1 error */
  #if defined(STM32F100X8_XB) || defined(STM32F100RC_RD_RE) || \
      defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_I2C2_EV            33 I2C2 event */
     _OSIOHandler, /* OS_IO_I2C2_ER            34 I2C2 error */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_SPI1                  35 SPI1 global */
  #if defined(STM32F100X8_XB) || defined(STM32F100RC_RD_RE) || \
      defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_SPI2               36 SPI2 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_USART1                37 USART1 global */
  _OSIOHandler, /* OS_IO_USART2                38 USART2 global */
  #if defined(STM32F100X8_XB) || defined(STM32F100RC_RD_RE) || \
      defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_USART3             39 USART3 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_EXTI15_10             40 External line [15:10] */
  _OSIOHandler, /* OS_IO_RTCAlarm              41 RTC alarm through EXTI line */
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG) || defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_USBWakeUp          42 USB Device WakeUp from suspend through
                                                  EXTI Line */
  #elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
        defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
     _OSIOHandler, /* OS_IO_CEC                42 HDMI-CEC */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_OTG_FS_WKUP        42 USB OTG FS wakeup from suspend through
                                                  EXTI line */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE)
     _OSIOHandler, /* OS_IO_TIM8_BRK           43 TIM8 Break */
     _OSIOHandler, /* OS_IO_TIM8_UP            44 TIM8 Update */
     _OSIOHandler, /* OS_IO_TIM8_TRG_COM       45 TIM8 Trigger and Commutation */
     _OSIOHandler, /* OS_IO_TIM8_CC            46 TIM8 Capture Compare */
  #elif defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
        defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE )
     _OSIOHandler, /* OS_IO_TIM12              43 TIM12 global */
     _OSIOHandler, /* OS_IO_TIM13              44 TIM13 global */
     _OSIOHandler, /* OS_IO_TIM14              45 TIM14 global */
     #if defined(DEBUG_MODE)
        UndefinedInterrupt,
     #else
        NULL,
     #endif
  #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_TIM8_BRK_TIM12        43 TIM8 Break and TIM12 global */
     _OSIOHandler, /* OS_IO_TIM8_UP_TIM13         44 TIM8 Update and TIM13 global */
     _OSIOHandler, /* OS_IO_TIM8_TRG_COM_TIM14    45 TIM8 Trigger and Commutation  and TIM14 global */
     _OSIOHandler, /* OS_IO_TIM8_CC               46 TIM8 Capture Compare */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
     NULL,
     NULL,
  #endif
  #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_ADC3                  47 ADC3 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101VF_VG_ZF_ZG) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_FSMC                  48 FSMC global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_SDIO                  49 SDIO global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
